# Kevin
# Introduction to Pandas

_pandas_ is designed to make it easier to work with structured data. Most of the analyses you might perform will likely involve using tabular data, e.g., from .csv files or relational databases (e.g., SQL). The pandas name itself is derived from panel data, an econometrics term for multidimensional structured data sets, and Python data analysis itself. In this notebook, we will go through some examples to get you familiar with the pandas package.

In [1]:
# import pandas using the conventional abbreviation
import numpy as np
import pandas as pd

from IPython.display import display, HTML

## Series and DataFrame in Pandas
There are two fundamental data structures in Pandas:
- Series: a one-dimensional array of indexed data. (the equivalent of _vector_ in R)
- DataFrame: a two-dimensional array of indexed data. (the equivalent of _data frame_ in R)

We can create pandas series and dataframes from raw data as follows.

In [2]:
# create a pandas series
s = pd.Series([0.25, 0.5, 0.75, 1.0], index=['a', 'b', 'c', 'd'])
print("This is a pandas series:")
display(s)

# you can access the number in a pandas series using either the labelled index or the integer index.
print("Access the first number with labelled index: {0} and with integer index: {1}".format(s['a'], s[0]))

# create a pandas dataframe
df = pd.DataFrame({
    'value': [0.25, 0.5, 0.75, 1.0],
    'label': ['A', 'B', 'C', 'D']
})
print("This is a pandas dataframe:")
display(df)

df1 = pd.DataFrame({'x': s, 'y': s})
print("This is another pandas dataframe:")
display(df1)

This is a pandas series:

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64

Access the first number with labelled index: 0.25 and with integer index: 0.25
This is a pandas dataframe:

   value label
0   0.25     A
1   0.50     B
2   0.75     C
3   1.00     D

This is another pandas dataframe:

      x     y
a  0.25  0.25
b  0.50  0.50
c  0.75  0.75
d  1.00  1.00

### Quiz:
Create a dataframe from feature and label below with proper row index and col index.

In [3]:
np.random.seed(0)  # seed for reproducibility

feature = np.random.randint(10, size=6)
label = np.array(['p', 'n', 'n', 'p', 'n', 'n'])
row_index = np.array(['a', 'b', 'c', 'd', 'e', 'f'])

# TODO
df2 = pd.DataFrame({
    'feature': feature,
    'label': label
})

## Basic properties of a series or dataframe

In [4]:
# basis properties of a series
print("Length of the series: {}".format(len(s)))
print("Index names of the series: {}".format(list(s.index)))

# basis properties of a dataframe
print("Column names of the dataframe: {}".format(list(df.columns)))
print("Index names of the dataframe: {}".format(list(df.index)))
print("Number of dimensions of the dataframe: {}".format(df.ndim))
print("Shape of the dataframe: {}".format(df.shape))

# statistics of a numerical data column
display(df2['feature'].describe())

# frequency of a categorical data column
display(df2['label'].value_counts())
df2

Length of the series: 4
Index names of the series: ['a', 'b', 'c', 'd']
Column names of the dataframe: ['value', 'label']
Index names of the dataframe: [0, 1, 2, 3]
Number of dimensions of the dataframe: 2
Shape of the dataframe: (4, 2)

count    6.000000
mean     4.500000
std      3.209361
min      0.000000
25%      3.000000
50%      4.000000
75%      6.500000
max      9.000000
Name: feature, dtype: float64

n    4
p    2
Name: label, dtype: int64

   feature label
0        5     p
1        0     n
2        3     n
3        3     p
4        7     n
5        9     n

## Loading data into a Dataframe from text file

In [5]:
# read a csv file
pop = pd.read_csv('https://raw.githubusercontent.com/jakevdp/PythonDataScienceHandbook/master/notebooks/data/state-population.csv')
display(pop.head())

# rename
pop.rename(columns={"state/region": "state"}, inplace=True)
display(pop.head())

  state/region     ages  year  population
0           AL  under18  2012   1117489.0
1           AL    total  2012   4817528.0
2           AL  under18  2010   1130966.0
3           AL    total  2010   4785570.0
4           AL  under18  2011   1125763.0

  state     ages  year  population
0    AL  under18  2012   1117489.0
1    AL    total  2012   4817528.0
2    AL  under18  2010   1130966.0
3    AL    total  2010   4785570.0
4    AL  under18  2011   1125763.0

## Data indexing, slicing and filtering
To address a subset of data in a dataframe, we can use either [loc](https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.loc.html) or [iloc](https://pandas.pydata.org/pandas-docs/version/0.17.0/generated/pandas.DataFrame.iloc.html) functions in pandas API.
- loc: Access a group of rows and columns by label(s) or a boolean array.
- iloc: Purely integer-location based indexing for selection by position.

In [6]:
# indexing & slicing using index and column names
display(pop.loc[2, ['state', 'population']])
display(pop.loc[1:4, ['state', 'population']])

# indexing & slicing using index and column integer indices
display(pop.iloc[:3, :3])

pop_age_year = pop.loc[:, ['ages', 'population']]
display(pop_age_year.head())

# filtering
pop_2012 = pop.loc[pop['year'] == 2012, :]
display(pop_2012.head())

# filtering on multiple columns
pop_2012_total = pop.loc[(pop['year'] == 2012) & (pop['ages'] == 'total'), :]
display(pop_2012_total.head())

# filtering and slicing
pop_2012_total_2 = pop.loc[(pop['year'] == 2012) & (pop['ages'] == 'total'), ['state', 'population']]
display(pop_2012_total_2.head())

state                  AL
population    1.13097e+06
Name: 2, dtype: object

  state  population
1    AL   4817528.0
2    AL   1130966.0
3    AL   4785570.0
4    AL   1125763.0

  state     ages  year
0    AL  under18  2012
1    AL    total  2012
2    AL  under18  2010

      ages  population
0  under18   1117489.0
1    total   4817528.0
2  under18   1130966.0
3    total   4785570.0
4  under18   1125763.0

   state     ages  year  population
0     AL  under18  2012   1117489.0
1     AL    total  2012   4817528.0
94    AK  under18  2012    188162.0
95    AK    total  2012    730307.0
96    AZ  under18  2012   1617149.0

    state   ages  year  population
1      AL  total  2012   4817528.0
95     AK  total  2012    730307.0
97     AZ  total  2012   6551149.0
191    AR  total  2012   2949828.0
193    CA  total  2012  37999878.0

    state  population
1      AL   4817528.0
95     AK    730307.0
97     AZ   6551149.0
191    AR   2949828.0
193    CA  37999878.0

### Quiz: Find the total population for WA in year 2010.

In [8]:
# TODO
pop[(pop['year'] == 2010) & (pop['ages'] == 'total') & (pop['state'] == 'WA')]

     state   ages  year  population
2298    WA  total  2010   6742256.0

### Quiz: Calculate the median of population for all age groups across all states in 2010.

In [ ]:
# TODO

## Concatenating multiple Dataframes

In [ ]:
pop_wa = pop.loc[(pop['state'] == 'WA') & (pop['year'].isin([2011, 2012])), :]
print("pop_wa:\n {}".format(pop_wa.head()))

pop_or = pop.loc[(pop['state'] == 'OR') & (pop['year'].isin([2011, 2012])), :]
print("pop_or:\n {}".format(pop_or.head()))

pop_nw = pd.concat([pop_wa, pop_or])
print("pop_nw:\n {}".format(pop_nw.head(10)))

## Joining multiple Dataframes

In [ ]:
# join options: innerm, left, right and outer
food = pd.DataFrame({
    'name': ['Peter', 'Paul', 'Mary'],
    'food': ['fish', 'beans', 'bread']},
    columns=['name', 'food'])
drink = pd.DataFrame({
    'name': ['Mary', 'Joseph'],
    'drink': ['wine', 'beer']},
    columns=['name', 'drink'])
display(food)
display(drink)

# default inner join
join_inner = pd.merge(food, drink, how='inner')
display(join_inner)

# default left join
join_left = pd.merge(food, drink, how='left')
display(join_left)

# default right join
join_right = pd.merge(food, drink, how='right')
display(join_right)

# default outer join
join_outer = pd.merge(food, drink, how='outer')
display(join_outer)

In [ ]:
areas = pd.read_csv('https://raw.githubusercontent.com/jakevdp/PythonDataScienceHandbook/master/notebooks/data/state-areas.csv')
areas.rename(columns={'area (sq. mi)': 'area'}, inplace=True)
display(areas.head())

abbrevs = pd.read_csv('https://raw.githubusercontent.com/jakevdp/PythonDataScienceHandbook/master/notebooks/data/state-abbrevs.csv')
display(abbrevs.head())

### Quiz: Join pop dataframe with abbrevs and areas dataframes to find the areas for each state.

In [ ]:
# TODO

## Sorting dataframe

In [ ]:
# find the state with the largest population per square mile
pop_abbrevs_areas['density'] = pop_abbrevs_areas['population'] / pop_abbrevs_areas['area']
pop_density_2012 = pop_abbrevs_areas.loc[(pop_abbrevs_areas['ages'] == 'total') & (pop_abbrevs_areas['year'] == 2012),:]
display(pop_density_2012.sort_values('density', ascending=False).head(10))

### Quiz: Find the 10th largest city in terms of population in 2010 based on age < 18.

In [ ]:
# TODO

## Data aggregation

In [ ]:
# aggregate over all numerical columns
display(pop_abbrevs_areas.groupby('year').sum().head())

# aggregate over a particular column
display(pop_abbrevs_areas.groupby('year')['population'].describe().head())

# different aggregations over different columns
display(pop_abbrevs_areas.groupby('year', as_index=False).aggregate({
    'population': ['mean', 'std'],
    'area': ['max', 'min']}))

## Pivot Tables

In [ ]:
pop_abbrevs_areas['after 2000'] = pop_abbrevs_areas['year'] > 2000
pop_abbrevs_areas_orwa = pop_abbrevs_areas.loc[pop_abbrevs_areas['state'].isin(['Oregon', 'Washington']), :]

display(pop_abbrevs_areas_orwa.pivot_table(
    index='after 2000', 
    columns='state',
    aggfunc={'population': 'mean', 'area':'mean'}
))

### Quiz: Get the min, max, mean and median of the population density between 1990 and 2010 based on age group < 18.

In [ ]:
# TODO

# End of Introduction to Pandas

In [19]:
X = np.array([43,44,45,46,47],float)
Y_HAT = [41,45,49,47,44]
Y = 10.2 + 0.8*X
print(Y_HAT)
sum((Y-Y_HAT)**2)/len(X)

[44.6 45.4 46.2 47.  47.8]

7.079999999999984